ERP.belugaerp/src/InformationRegisters/бг_НалогообложениеАкцизомОрганизаций/бг_НалогообложениеАкцизомОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НалогообложениеАкцизомОрганизаций</name>
  <resources>
    <name>ВидОперацииНалогообложения</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкциза</name>
    <type>
      <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеСырья</name>
    <type>
      <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусНачисленияАванса</name>
    <type>
      <types>EnumRef.бг_СтатусыНачисленияАвансов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродажаНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_КодыВидовОперацийНалогообложенияАкцизом/бг_КодыВидовОперацийНалогообложенияАкцизом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_КодыВидовОперацийНалогообложенияАкцизом</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВидПодакцизныхТоваров</name>
    <type>
      <types>CatalogRef.бг_ВидыПодакцизныхТоваров</types>
    </type>
  </resources>
  <resources>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_СостоянияПодакцизногоСырья/бг_СостоянияПодакцизногоСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияПодакцизногоСырья</name>
  <enumValues>
    <name>ВМестахХранения</name>
  </enumValues>
  <enumValues>
    <name>ВГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВСпиртосодержащейСмеси</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантии</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЭкспортКромеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗСверхНормы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортГарантии</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭСГарантии</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ВидМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторВидовМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаГенерации</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаИнвойса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаРегистрацииДвиженийЕГАИС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаСлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДокументВыпуска</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.битИнвентаризацияПродукцииЕГАИС</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДокументГенераторСерии</name>
    <type>
      <types>DocumentRef.ТТНВходящаяЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗаявлениеОВыдачеФСМ</name>
    <type>
      <types>DocumentRef.битЗаявлениеОВыдачеФСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИдентификаторСтрокиТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонечныйНомерДиапазона</name>
    <comment>Last</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НакладнаяНаВыдачуФСМ</name>
    <type>
      <types>DocumentRef.битНакладнаяНаВыдачуФСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НачальныйНомерДиапазона</name>
    <comment>Start</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерДиапазонаВРулоне</name>
    <comment>RangeNumberInRoll</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерРулона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерСертифицированнойПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОрганизацияВладелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОрганизацияЕГАИСВладелец</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПолныйКонечныйНомерДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПолныйНачальныйНомерДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СерияМарки</name>
    <comment>Разряд</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СерияРеализации</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаНазначения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УдалитьАдресФайлаУдостоверенияКачества</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УпаковкаПаллета</name>
    <comment>BG-757</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФактическаяКрепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЭтоГотоваяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Справка2ЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/бг_УчетАкцизов/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСуммуАкциза(Объект, ТабличнаяЧасть, ВыделенныеСтроки = Неопределено) Экспорт

	Если ТабличнаяЧасть.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Получение выгрузки по табличной части
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
		ЭтоВозвратТоваров = Истина;
		КолонкиВыгрузки = "НомерСтроки, Номенклатура, Серия, ДокументРеализации, Количество";
	Иначе
		ЭтоВозвратТоваров = Ложь;
		КолонкиВыгрузки = "НомерСтроки, Номенклатура, Количество";
	КонецЕсли;
	Таблица = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
	ТабличнаяЧасть,
	ВыделенныеСтроки,
	КолонкиВыгрузки);
		
	Запрос = Новый Запрос;
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.ДокументОснование), 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Дата"), ТекущаяДатаСеанса()));
	Иначе
		Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров")
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.ВнутреннееПотреблениеТоваров") Тогда
		Запрос.УстановитьПараметр("СостояниеСырья", Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме);
		Запрос.УстановитьПараметр("ПродажаНаЭкспорт", Ложь);
	Иначе
		Запрос.УстановитьПараметр("СостояниеСырья", Перечисления.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции);
		Запрос.УстановитьПараметр("ПродажаНаЭкспорт", Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт);
	КонецЕсли;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("КоличествоЛитровВДале", 10);

	Если ЭтоВозвратТоваров Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(Таблица.ДокументРеализации КАК Документ.РеализацияТоваровУслуг) КАК ДокументРеализации,
		|	ВЫРАЗИТЬ(Таблица.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
		|	Таблица.Количество КАК Количество
		|ПОМЕСТИТЬ втТаблицаТоварыПодг
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	втТаблицаТовары.Номенклатура КАК Номенклатура,
		|ВЫБОР 
		|	КОГДА втТаблицаТовары.Серия.бг_ДатаРеализации <> ДАТАВРЕМЯ(1, 1, 1)
		|		ТОГДА втТаблицаТовары.Серия.бг_ДатаРеализации
		|	ИНАЧЕ 
		|		ISNULL(втТаблицаТовары.ДокументРеализации.Дата, &Дата)
		|	КОНЕЦ КАК ДатаПолученияСтавки,
		|	втТаблицаТовары.Количество КАК Количество,
		|	втТаблицаТовары.Количество * втТаблицаТовары.Номенклатура.ОбъемДАЛ * &КоличествоЛитровВДале * втТаблицаТовары.Номенклатура.Крепость / 100 КАК КоличествоЛитровБС
		// Количество литров * Крепость / 100%
		|ПОМЕСТИТЬ втТаблицаТовары
		|ИЗ
		|	втТаблицаТоварыПодг КАК втТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	втТаблицаТовары.Номенклатура КАК Номенклатура,
		|	втТаблицаТовары.Количество КАК Количество,
		|	ЕСТЬNULL(втТаблицаТовары.КоличествоЛитровБС * бг_КодыВидовОперацийНалогообложенияАкцизом.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) КАК СуммаАкциза
		|ИЗ
		|	втТаблицаТовары КАК втТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_НалогообложениеАкцизомОрганизаций КАК НалогообложениеАкцизомОрганизаций
		|		ПО (НалогообложениеАкцизомОрганизаций.Организация = &Организация)
		|			И (НалогообложениеАкцизомОрганизаций.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ПустаяСсылка))
		|			И (НалогообложениеАкцизомОрганизаций.СостояниеСырья = &СостояниеСырья)
		|			И (НалогообложениеАкцизомОрганизаций.СтатусНачисленияАванса = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ПустаяСсылка))
		|			И (НалогообложениеАкцизомОрганизаций.ПродажаНаЭкспорт = &ПродажаНаЭкспорт)
		|			И (НалогообложениеАкцизомОрганизаций.Номенклатура В (втТаблицаТовары.Номенклатура, втТаблицаТовары.Номенклатура.ВидНоменклатуры))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК бг_КодыВидовОперацийНалогообложенияАкцизом
		|		ПО (НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения = бг_КодыВидовОперацийНалогообложенияАкцизом.ВидОперацииНалогообложенияАкцизом)
		|			И (бг_КодыВидовОперацийНалогообложенияАкцизом.Период В
		|				(ВЫБРАТЬ
		|					МАКСИМУМ(бг_КодыВидовОперацийНалогообложенияАкцизомПериод.Период)
		|				ИЗ
		|					РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом КАК бг_КодыВидовОперацийНалогообложенияАкцизомПериод
		|				ГДЕ
		|					НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения = бг_КодыВидовОперацийНалогообложенияАкцизомПериод.ВидОперацииНалогообложенияАкцизом
		|					И бг_КодыВидовОперацийНалогообложенияАкцизомПериод.Период <= втТаблицаТовары.ДатаПолученияСтавки))";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Количество КАК Количество
		|ПОМЕСТИТЬ втТаблицаТоварыПодг
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	втТаблицаТовары.Номенклатура КАК Номенклатура,
		|	втТаблицаТовары.Количество КАК Количество,
		|	втТаблицаТовары.Количество * втТаблицаТовары.Номенклатура.ОбъемДАЛ * &КоличествоЛитровВДале * втТаблицаТовары.Номенклатура.Крепость / 100 КАК КоличествоЛитровБС
		// Количество литров * Крепость / 100%
		|ПОМЕСТИТЬ втТаблицаТовары
		|ИЗ
		|	втТаблицаТоварыПодг КАК втТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	втТаблицаТовары.Номенклатура КАК Номенклатура,
		|	втТаблицаТовары.Количество КАК Количество,
		|	ЕСТЬNULL(втТаблицаТовары.КоличествоЛитровБС * бг_КодыВидовОперацийНалогообложенияАкцизомСрезПоследних.ВидПодакцизныхТоваров.НалоговаяСтавка, 0) КАК СуммаАкциза
		|ИЗ
		|	втТаблицаТовары КАК втТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бг_НалогообложениеАкцизомОрганизаций КАК НалогообложениеАкцизомОрганизаций
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_КодыВидовОперацийНалогообложенияАкцизом.СрезПоследних(&Дата, ) КАК бг_КодыВидовОперацийНалогообложенияАкцизомСрезПоследних
		|			ПО НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения = бг_КодыВидовОперацийНалогообложенияАкцизомСрезПоследних.ВидОперацииНалогообложенияАкцизом
		|		ПО (НалогообложениеАкцизомОрганизаций.Организация = &Организация)
		|			И (НалогообложениеАкцизомОрганизаций.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ПустаяСсылка))
		|			И (НалогообложениеАкцизомОрганизаций.СостояниеСырья = &СостояниеСырья)
		|			И (НалогообложениеАкцизомОрганизаций.СтатусНачисленияАванса = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ПустаяСсылка))
		|			И (НалогообложениеАкцизомОрганизаций.ПродажаНаЭкспорт = &ПродажаНаЭкспорт)
		|			И (НалогообложениеАкцизомОрганизаций.Номенклатура В (втТаблицаТовары.Номенклатура, втТаблицаТовары.Номенклатура.ВидНоменклатуры))";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТабличнойЧасти = ТабличнаяЧасть[Выборка.НомерСтроки-1];
		СтрокаТабличнойЧасти.бг_СуммаАкциза = Выборка.СуммаАкциза;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
